<details><summary>Digger run report at 2024-09-30 17:06:31 (UTC)</summary>
  <details><summary>Apply for <b>anzeha/argocd-infra#infrastructure-live_dev_cluster</b></summary>
  
```terraform
Terraform will perform the following actions:

  # module.gke.google_container_node_pool.pools["cicd-node-pool-dev"] will be updated in-place
  ~ resource "google_container_node_pool" "pools" {
        id                          = "projects/deployment-433913/locations/europe-west4-a/clusters/cicd-gke-cluster-dev/nodePools/cicd-node-pool-dev"
        name                        = "cicd-node-pool-dev"
        # (11 unchanged attributes hidden)

      ~ node_config {
          ~ machine_type                = "e2-standard-2" -> "e2-medium"
            tags                        = [
                "gke-cicd-gke-cluster-dev",
                "gke-cicd-gke-cluster-dev-cicd-node-pool-dev",
            ]
            # (19 unchanged attributes hidden)

            # (3 unchanged blocks hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.gke_auth.data.google_client_config.provider will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_client_config" "provider" {
      + access_token   = (sensitive value)
      + default_labels = (known after apply)
      + id             = (known after apply)
      + project        = (known after apply)
      + region         = (known after apply)
      + zone           = (known after apply)
    }

  # module.gke_auth.data.google_container_cluster.gke_cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_cluster" "gke_cluster" {
      + addons_config                            = (known after apply)
      + allow_net_admin                          = (known after apply)
      + authenticator_groups_config              = (known after apply)
      + binary_authorization                     = (known after apply)
      + cluster_autoscaling                      = (known after apply)
      + cluster_ipv4_cidr                        = (known after apply)
      + confidential_nodes                       = (known after apply)
      + cost_management_config                   = (known after apply)
      + database_encryption                      = (known after apply)
      + datapath_provider                        = (known after apply)
      + default_max_pods_per_node                = (known after apply)
      + default_snat_status                      = (known after apply)
      + deletion_protection                      = (known after apply)
      + description                              = (known after apply)
      + dns_config                               = (known after apply)
      + enable_autopilot                         = (known after apply)
      + enable_cilium_clusterwide_network_policy = (known after apply)
      + enable_intranode_visibility              = (known after apply)
      + enable_k8s_beta_apis                     = (known after apply)
      + enable_kubernetes_alpha                  = (known after apply)
      + enable_l4_ilb_subsetting                 = (known after apply)
      + enable_legacy_abac                       = (known after apply)
      + enable_multi_networking                  = (known after apply)
      + enable_shielded_nodes                    = (known after apply)
      + enable_tpu                               = (known after apply)
      + endpoint                                 = (known after apply)
      + fleet                                    = (known after apply)
      + gateway_api_config                       = (known after apply)
      + id                                       = (known after apply)
      + identity_service_config                  = (known after apply)
      + initial_node_count                       = (known after apply)
      + ip_allocation_policy                     = (known after apply)
      + label_fingerprint                        = (known after apply)
      + location                                 = "europe-west4-a"
      + logging_config                           = (known after apply)
      + logging_service                          = (known after apply)
      + maintenance_policy                       = (known after apply)
      + master_auth                              = (known after apply)
      + master_authorized_networks_config        = (known after apply)
      + master_version                           = (known after apply)
      + mesh_certificates                        = (known after apply)
      + min_master_version                       = (known after apply)
      + monitoring_config                        = (known after apply)
      + monitoring_service                       = (known after apply)
      + name                                     = "cicd-gke-cluster-dev"
      + network                                  = (known after apply)
      + network_policy                           = (known after apply)
      + networking_mode                          = (known after apply)
      + node_config                              = (known after apply)
      + node_locations                           = (known after apply)
      + node_pool                                = (known after apply)
      + node_pool_auto_config                    = (known after apply)
      + node_pool_defaults                       = (known after apply)
      + node_version                             = (known after apply)
      + notification_config                      = (known after apply)
      + operation                                = (known after apply)
      + private_cluster_config                   = (known after apply)
      + private_ipv6_google_access               = (known after apply)
      + project                                  = "deployment-433913"
      + release_channel                          = (known after apply)
      + remove_default_node_pool                 = (known after apply)
      + resource_labels                          = (known after apply)
      + resource_usage_export_config             = (known after apply)
      + security_posture_config                  = (known after apply)
      + self_link                                = (known after apply)
      + service_external_ips_config              = (known after apply)
      + services_ipv4_cidr                       = (known after apply)
      + subnetwork                               = (known after apply)
      + tpu_ipv4_cidr_block                      = (known after apply)
      + vertical_pod_autoscaling                 = (known after apply)
      + workload_identity_config                 = (known after apply)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ host                   = (sensitive value)
  ~ token                  = (sensitive value)
module.gke.google_container_node_pool.pools["cicd-node-pool-dev"]: Modifying... [id=projects/deployment-433913/locations/europe-west4-a/clusters/cicd-gke-cluster-dev/nodePools/cicd-node-pool-dev]
module.gke.google_container_node_pool.pools["cicd-node-pool-dev"]: Still modifying... [id=projects/deployment-433913/locations/eu...uster-dev/nodePools/cicd-node-pool-dev, 10s elapsed]
module.gke.google_container_node_pool.pools["cicd-node-pool-dev"]: Still modifying... [id=projects/deployment-433913/locations/eu...uster-dev/nodePools/cicd-node-pool-dev, 20s elapsed]
module.gke.google_container_node_pool.pools["cicd-node-pool-dev"]: Still modifying... [id=projects/deployment-433913/locations/eu...uster-dev/nodePools/cicd-node-pool-dev, 30s elapsed]
module.gke.google_container_node_pool.pools["cicd-node-pool-dev"]: Still modifying... [id=projects/deployment-433913/locations/eu...uster-dev/nodePools/cicd-node-pool-dev, 40s elapsed]
module.gke.google_container_node_pool.pools["cicd-node-pool-dev"]: Still modifying... [id=projects/deployment-433913/locations/eu...uster-dev/nodePools/cicd-node-pool-dev, 50s elapsed]
module.gke.google_container_node_pool.pools["cicd-node-pool-dev"]: Still modifying... [id=projects/deployment-433913/locations/eu...uster-dev/nodePools/cicd-node-pool-dev, 1m0s elapsed]
module.gke.google_container_node_pool.pools["cicd-node-pool-dev"]: Still modifying... [id=projects/deployment-433913/locations/eu...uster-dev/nodePools/cicd-node-pool-dev, 1m10s elapsed]
module.gke.google_container_node_pool.pools["cicd-node-pool-dev"]: Still modifying... [id=projects/deployment-433913/locations/eu...uster-dev/nodePools/cicd-node-pool-dev, 1m20s elapsed]
module.gke.google_container_node_pool.pools["cicd-node-pool-dev"]: Still modifying... [id=projects/deployment-433913/locations/eu...uster-dev/nodePools/cicd-node-pool-dev, 1m30s elapsed]
module.gke.google_container_node_pool.pools["cicd-node-pool-dev"]: Still modifying... [id=projects/deployment-433913/locations/eu...uster-dev/nodePools/cicd-node-pool-dev, 1m40s elapsed]
module.gke.google_container_node_pool.pools["cicd-node-pool-dev"]: Still modifying... [id=projects/deployment-433913/locations/eu...uster-dev/nodePools/cicd-node-pool-dev, 1m50s elapsed]
module.gke.google_container_node_pool.pools["cicd-node-pool-dev"]: Modifications complete after 1m54s [id=projects/deployment-433913/locations/europe-west4-a/clusters/cicd-gke-cluster-dev/nodePools/cicd-node-pool-dev]
module.gke_auth.data.google_client_config.provider: Reading...
module.gke_auth.data.google_container_cluster.gke_cluster: Reading...
module.gke_auth.data.google_client_config.provider: Read complete after 0s [id=projects/"deployment-433913"/regions/"europe-west4"/zones/<null>]
module.gke_auth.data.google_container_cluster.gke_cluster: Read complete after 1s [id=projects/deployment-433913/locations/europe-west4-a/clusters/cicd-gke-cluster-dev]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.

Outputs:

cluster_ca_certificate = <sensitive>
cluster_name = "cicd-gke-cluster-dev"
host = <sensitive>
token = <sensitive>

  ```
</details>
</details>